In [1]:
import pandas as pd
import numpy as np
import datetime

np.random.seed(56)

In [2]:
dfKota = pd.DataFrame(data=[[1, 'Jakarta'], 
                       [2, 'Tangerang'], 
                       [3,'Bandung'],
                       [4,'Semarang'],
                       [5,'Denpasar'],
                       [6,'Surabaya']], columns=['id','nama'])
dfKota

   id       nama
0   1    Jakarta
1   2  Tangerang
2   3    Bandung
3   4   Semarang
4   5   Denpasar
5   6   Surabaya

In [3]:
dataToko = []
def GenerateKota() :
    randNum = np.random.randint(1,11)
    if(randNum < 4) :
        return 1
    elif(randNum < 7) :
        return 2
    elif(randNum == 7) :
        return 3
    elif(randNum == 8) :
        return 4
    elif(randNum == 9) :
        return 5
    elif(randNum == 10) :
        return 6

In [4]:
for num in range(1,101) :
    dataToko.append([num, 
                     'Toko ' + str(num), 
                     GenerateKota(), 
                     'Alamat ' + str(num), 
                     np.random.randint(1000,10001),
                    datetime.datetime(np.random.randint(2015,2019), np.random.randint(1,13), np.random.randint(1,28))])
    
dfToko = pd.DataFrame(data=dataToko,columns=['id','nama','kotaId','alamat','totalIncome','tanggalBerdiri'])
dfToko.head()

   id    nama  kotaId    alamat  totalIncome tanggalBerdiri
0   1  Toko 1       2  Alamat 1         3532     2018-01-03
1   2  Toko 2       6  Alamat 2         1087     2017-05-26
2   3  Toko 3       4  Alamat 3         5975     2016-09-13
3   4  Toko 4       1  Alamat 4         4083     2017-01-22
4   5  Toko 5       3  Alamat 5         1929     2016-11-06

In [5]:
dfToko.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 100 entries, 0 to 99
Data columns (total 6 columns):
id                100 non-null int64
nama              100 non-null object
kotaId            100 non-null int64
alamat            100 non-null object
totalIncome       100 non-null int64
tanggalBerdiri    100 non-null datetime64[ns]
dtypes: datetime64[ns](1), int64(3), object(2)
memory usage: 4.8+ KB

In [6]:
dfToko['kotaId'].value_counts()

2    28
1    26
5    13
4    12
3    11
6    10
Name: kotaId, dtype: int64

In [7]:
len(dfToko[dfToko['tanggalBerdiri'] > datetime.datetime(2017,1,5)])

47

In [8]:
dfKota.to_csv('dataKota.csv',index=False)
dfToko.to_csv('dataToko.csv',index=False)